Roof Soffit sketch is invalid.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId InvalidSketchForRoofsoffit { get; }
  Visual Basic
Public Shared ReadOnly Property InvalidSketchForRoofsoffit As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ InvalidSketchForRoofsoffit {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace